app/Http/Controllers/TopicsController.php

select * from `categories`
---
    public function create(Topic $topic)
    {
        $categories = Category::all();

insert into `topics` (`title`, `category_id`, `body`, `user_id`, `excerpt`, `updated_at`, `created_at`) values ('sync3', '1', '<p><span style=\"color:rgb(248,248,242);font-size:13.5px;\">sync</span><br /></p>', '1', 'sync', '2018-11-09 17:58:04', '2018-11-09 17:58:04')
---
  public function store(TopicRequest $request, Topic $topic)
    {
        $topic->fill($request->all());
        $topic->user_id = Auth::id();
        $topic->save();

select * from `categories`
---
	public function edit(Topic $topic)
	{
        $this->authorize('update', $topic);
		$categories = Category::all();

update `topics` set `body` = '<p>斯蒂芬森</p>', `excerpt` = '斯蒂芬森', `updated_at` = '2018-11-09 16:35:32' where `id` = '110'
---
	public function update(TopicRequest $request, Topic $topic)
	{
		$this->authorize('update', $topic);
		$topic->update($request->all());