app/Http/Controllers/UsersController.php

update `users` set `updated_at` = '2018-11-12 10:13:52', `avatar` = 'http://larabbs.test/uploads/images/avatars/201811/12/11_1541988832_IVNeknXH8C.jpg', `introduction` = '123' where `id` = '11'
---
    public function update(UserRequest $request, ImageUploadHandler $uploader, User $user)
    {
        $this->authorize('update', $user);
        $data = $request->all();

        if ($request->avatar) {
            $result = $uploader->save($request->avatar, 'avatars', $user->id, 362);
            if ($result) {
                $data['avatar'] = $result['path'];
            }
        }
        $user->update($data);